Repository: bbarker/Visopsys
Catalog: contrib/ap0r-jens-*/src/kernel/*/kernel.po
Languages: es

source: *** Your boot disk appears to be running in unsupported native-SATA mode. *** You may be able to temporarily enable ATA or 'legacy' IDE mode in *** your BIOS setup.
es: *** Su disco de arranque está utilizando el modo SATA nativo. *** Este modo no es soportado actualmente, pero usted deberia poder habilitar *** el modo ATA o IDE en la configuracion de su BIOS.

source: %llu files need defragmentation
es: %llu archivos necesitan defragmentacion

source: Analyzing
es: Analizando

source: Checking constraints
es: Chequeando limites

source: Clearing new FAT sectors
es: Limpiando nuevos sectores FAT

source: Data exists outside the new size (%u >= %llu)
es: Aún existe informacion fuera del nuevo tamaño (%u >= %llu)

source: Defragmenting %llu/%llu: %s
es: Defragmentando %llu/%llu: %s

source: Error clearing new FAT sectors
es: Error limpiando sectores FAT

source: Error defragmenting filesystem
es: Error al defragmentar

source: Error getting memory
es: Error ubicando memoria

source: Error getting resizing constraints
es: Error al buscar los límites de cambio de tamaño

source: Error moving data
es: Error moviendo datos

source: Error reading filesystem info
es: Error al leer la informacion del sistema de archivos

source: Error synching FAT copies
es: Error al sincronizar las copias FAT

source: Error updating filesystem info
es: Error actualizando informacion del sistema de archivos

source: Filesystem cannot resize to %llu blocks (maximum is %llu)
es: El sistema de archivos no puede cambiar su tamaño a %llu bloques.(El maximo es %llu)

source: Filesystem cannot resize to %llu blocks (minimum is %llu)
es: El sistema de archivos no puede cambiar su tamaño a %llu bloques.(El minimo es %llu)

source: OK to power off now.
es: Ya puede apagar

source: Reading filesystem info
es: Leyendo informacion del sistema de archivos

source: Rebooting.
es: Reiniciando.

source: SYSTEM HALTED: Panic at %s:%s(%d)
es: SISTEMA DETENIDO: Panico en %s:%s(%d)

source: Shutting down
es: Apagando

source: Shutting down Visopsys, please wait...
es: Apagando Visopsys, espere por favor...

source: Updating filesystem info
es: Actualizando informacion del sistema de archivos

source: [ Wait for "OK to power off" message ]
es: [ Espere por el mensaje "Ya Puede Apagar" ]
