Repository: bbarker/Visopsys
Catalog: contrib/doga-turkish/src/programs/*/filesys.po
Languages: tr

source: The "%s" command only works in graphics mode
tr: "%s" komutu sadece grafik modda çalisabilir

source: Quitting.
tr: Çikiliyor.

source: Can't read/create the mount configuration
tr: Takilma konfigurasyonu okunamiyor/olusturulamiyor

source: Can't write the mount configuration
tr: Takilma konfigurasyonu yazilamiyor

source: Cancel
tr: Iptal

source: Error
tr: Hata

source: File systems
tr: Dosya sistemleri

source: Memory allocation error.
tr: Bellek ayirma hatasi.

source: Mount automatically at boot
tr: Boot sirasinda otomatik tak

source: Mount point:
tr: Takma noktasi:

source: No disks to work with.
tr: Üzerinde çalisilabilecek disk yok.

source: Quit
tr: Çik

source: Quit without writing changes?
tr: Degisiklikleri yazmadan çikmak istiyor musunuz?

source: Save
tr: Kaydet

source: Unable to get disk information.
tr: Disk bilgisi alinamiyor.

source: Unsaved changes
tr: Kaydedilmemis degisiklikler
