Repository: bbarker/Visopsys
Catalog: contrib/jens-*/src/kernel/*/kernel.po
Languages: de

source: *** Your boot disk appears to be running in unsupported native-SATA mode. *** You may be able to temporarily enable ATA or 'legacy' IDE mode in *** your BIOS setup.
de: *** Es scheint so, dass Ihre Boot-Disk im nativen SATA-Modus läuft. Dieser *** wird jedoch nicht unterstützt. Sie sollten vielleicht zeitweise den ATA- *** oder IDE-Modus (Legacy-Modus) in Ihren BIOS-Einstellungen aktivieren.

source: %llu files need defragmentation
de: %llu Dateien benötigen eine Defragmentierung

source: Analyzing
de: Analyse läuft

source: Checking constraints
de: Die Bedingungen werden überprüft

source: Clearing new FAT sectors
de: Die neuen FAT-Sektoren werden bereinigt

source: Data exists outside the new size (%u >= %llu)
de: Die Daten existieren außerhalb der neuen Größe (%u >= %llu)

source: Defragmenting %llu/%llu: %s
de: Defragmentieren von %llu/%llu: %s

source: Error clearing new FAT sectors
de: Fehler beim bereinigen der neuen FAT-Sektoren

source: Error defragmenting filesystem
de: Fehler beim Defragmentieren des Dateisystems

source: Error getting memory
de: Fehler beim beziehen von Speicher

source: Error getting resizing constraints
de: Fehler beim beziehen der Bedingungen für die Größenanpassung

source: Error moving data
de: Fehler beim verschieben der Daten

source: Error reading filesystem info
de: Fehler beim auslesen der Informationen zum Dateisystem

source: Error synching FAT copies
de: Fehler beim synchronisieren der FAT-Kopien

source: Error updating filesystem info
de: Fehler beim aktualisieren der Informationen zum Dateisystem

source: Filesystem cannot resize to %llu blocks (maximum is %llu)
de: Das Dateisystem kann nicht auf die Größe von %llu Blöcken angepasst werden (Maximum ist %llu)

source: Filesystem cannot resize to %llu blocks (minimum is %llu)
de: Das Dateisystem kann nicht auf die Größe von %llu Blöcken angepasst werden (Minimum ist %llu)

source: OK to power off now.
de: OK jetzt herunterzufahren

source: Reading filesystem info
de: Informationen zum Dateisystem werden ausgelesen

source: Rebooting.
de: Es wird neu gestartet.

source: SYSTEM HALTED: Panic at %s:%s(%d)
de: SYSTEM WURDE ANGEHALTEN: Fehler bei %s:%s(%d)

source: Shutting down
de: Herunterfahren

source: Shutting down Visopsys, please wait...
de: Visopsys wird heruntergefahren, bitte warten Sie...

source: Updating filesystem info
de: Aktualisieren der Informationen zum Dateisystem

source: [ Wait for "OK to power off" message ]
de: [ Es wird auf die Nachricht "OK zum herunterfahren" gewartet ]
