Repository: bbarker/Visopsys
Catalog: contrib/jens-*/src/programs/fdisk/*/fdisk.po
Languages: de

source: No disk selected. Quitting.
de: Kein Datenträger gewählt. Abbruch.

source: WARNING: %s
de: WARNUNG: %s

source: %s (I)gnore/(U)nmount/(C)ancel?:
de: %s (I) Ignorieren/(U) Trennen/(C) Abbrechen?:

source: %s (press 'Q' to cancel)
de: %s (wählen Sie 'Q' um abzubrechen)

source: %s or 'Q' to quit ->
de: %s oder 'Q' um abzubrechen ->

source: Change Partition Order %s
de: Ändere Partitionsordnung %s

source: Creating %s partition
de: Erstelle %s Partition

source: Current ending cylinder: %u
de: Aktueller Endzylinder: %u

source: Enter the hexadecimal code to set as the type ('L' to list, 'Q' to quit): ->
de: Geben Sie einen hexadezimalen Code als Bezeichnung ein ('L' für Liste, 'Q' für Abbruch): ->

source: Erasing data... (press 'Q' to cancel)
de: Entfernt Daten... (wählen Sie 'Q' um abzubrechen)

source: Fix these errors?
de: Diese Fehler beheben?

source: Fix this error?
de: Fehler beheben?

source: Press any key to continue.
de: Weiter mit beliebiger Taste.

source: -== %d changes pending ==-
de: -== %d Änderungen nicht gespeichert ==-

source: %s [Cursor up/down to select, '-' move up, '+' move down, Enter to accept, 'Q' to quit]
de: %s [Cursor hoch/runter um '-' nach oben, '+' unten zu verschieben, Eingabe als Bestätigung, 'Q' um abzubrechen]

source: %d hours
de: %d Stunden

source: %d minutes
de: %d Minuten

source: , or 'Q' to quit: ->
de: , oder 'Q' um abzubrechen: ->

source: /active
de: /aktiv

source: 1 hour
de: 1 Stunde

source: ? (This change cannot be undone)
de: ? (Diese Änderung kann nicht rückgängig gemacht werden)

source: A filesystem resize cannot be undone, and must be committed to disk immediately. You need to write your other changes to disk before continuing.
de: Skalierung des Dateisystems kann nicht rückgängig gemacht werden und muss sofort auf den Datenträger übertragen werden. Alle Änderungen sollten gespeichert werden bevor Sie fortfahren.

source: A partition defragmentation cannot be undone, and it is required that you write your other changes to disk before continuing.
de: Eine Partitions Defragmentierung kann nicht rückgängig gemacht werden. Sie sollten alle Änderungen speichern bevor Sie fortfahren.

source: A partition erase cannot be undone, and it is required that you write your other changes to disk before continuing.
de: Gelöschte Partitionen können nicht wiederhergestellt werden und Sie müssen alle anderen Änderungen speichern bevor Sie fortfahren.

source: A partition format cannot be undone, and it is required that you write your other changes to disk before continuing.
de: Formatierung kann nicht rückgängig gemacht werden. Speichern Sie alle Änderungen, bevor Sie fortfahren.

source: A partition move cannot be undone, and must be committed to disk immediately. You need to write your other changes to disk before continuing.
de: Verschieben der Partition kann nicht rückgängig gemacht werden und muss sofort auf den Datenträger übertragen werden. Sie müssen alle anderen Änderungen abspeichern, bevor Sie fortfahren.

source: After you write changes, the "active" partition will always boot automatically. Proceed?
de: Nachdem die Änderungen übernommen wurden, wird aktive Partition immer automatisch gestartet. Fortfahren?

source: Attributes
de: Eigenschaften

source: Can't Resize Filesystem
de: Dateisystem kann nicht skaliert werden

source: Can't create backup file
de: Es kann keine Backupdatei erstellt werden

source: Can't create dialog window
de: Kann kein Dialogfenster erstellen

source: Can't determine whether slice is used
de: Nicht erkennbar ob Zeitscheibenverfahren angewendet wird.

source: Can't get memory for a GPT entry array
de: Kein Speicher für GPT Datenfeld

source: Can't get memory for a GPT header
de: Kein Speicher für GPT Header

source: Can't get memory for a GPT header copy
de: Kein Speicher für Kopie von GPT Header

source: Can't locate simple MBR file %s
de: Kann keine einfache MBR Datei ermitteln %s

source: Can't open backup file %s
de: Kann Backupdatei %s nicht öffnen

source: Can't read GPT entries
de: Kann GPT Einträge nicht lesen

source: Can't read GPT header
de: Kann GPT Header nicht lesen

source: Can't read simple MBR file %s
de: Konnte einfache MBR Datei %s nicht lesen

source: Can't write GPT backup entries
de: Kann keine GPT Backup Einträge schreiben

source: Can't write GPT entries
de: Kann keine GPT Einträge schreiben

source: Can't write GPT header
de: Kann GPT Header nicht lesen

source: Can't write backup GPT header
de: Kann Backup GPT Header nicht lesen

source: Cancel
de: Abbrechen

source: Cancel
de: Abbrechen

source: Choose Disk
de: Datenträger wählen

source: Choose the FAT type:
de: Wählen Sie Art der FAT:

source: Choose the filesystem type:
de: Wählen Sie das Dateisystem:

source: Choose the partition type:
de: Wählen Sie eine Partitionsart:

source: Clear the partition table of disk %s?
de: Partitions-Tabelle von Datenträger %s löschen?

source: Collecting filesystem resizing constraints...
de: Sammle Beschränkungen der Skalierung des Dateisystems...

source: Committing changes to disk. Are you SURE?
de: Änderungen übernehmen. Sind Sie SICHER?

source: Confirmation
de: Bestätigung

source: Copy
de: Kopieren

source: Copy disk
de: Datenträger kopieren

source: Copy disk %s to disk %s. WARNING: THIS WILL DESTROY ALL DATA ON DISK %s. ARE YOU SURE YOU WANT TO DO THIS?
de: Kopiere Datenträger %s auf Datenträger %s. WARNUNG: SIE ZERSTÖREN ALLE DATEN AUF DEM DATENTRÄGER %s. WOLLEN SIE WIRKLICH FORTFAHREN?

source: Copying %u MB...
de: Kopiert %u MB...

source: Couldn't read MBR sector
de: Konnte MBR Abschnitt nicht lesen

source: Couldn't read partition table sector %u
de: Konnte Partitions-Tabellen Abschnitt %u nicht lesen

source: Couldn't write MBR sector
de: Konnte MBR Abschnitt nicht lesen

source: Couldn't write partition table sector %u
de: Konnte keinen Partitions-Tabellen Abschnitt schreiben %u

source: Create
de: Erstellen

source: Create Partition
de: Partition erstellen

source: Current ending cylinder: %u
de: Aktueller Endzylinder: %u

source: Cylinders
de: Zylinder

source: Default
de: Standard

source: Defragment
de: Defragmentieren

source: Defragment partition %s? (This change cannot be undone)
de: Partition defragmentieren %s? Änderung kann nicht rückgängig gemacht werden

source: Defragmentation complete
de: Defragmentierung abgeschlossen

source: Defragmenting...
de: Defragmentierung...

source: Delete
de: Entfernen

source: Delete all
de: Alle entfernen

source: Deleting active partition. You should set another partition active.
de: Löscht aktive Partition. Sie sollten eine andere Partition anwenden.

source: Discard changes to disk %s?
de: Änderungen an %s verwerfen?

source: Disk
de: Datenträger

source: Disk "%s" is missing geometry information.
de: Datenträger "%s" enthält keine Geometrie-Informationen.

source: Disk %d: [%s] %llu MB, %u cyls, %u heads, %u secs/cyl, %u bytes/sec
de: Datenträger %d: [%s] %llu MB, %u Zyl, %u Köpfe, %u Sekt/Zyl, %u Byte/Sek

source: Disk %s is smaller than the amount of data on disk %s. If you wish, you can continue and copy the data that will fit. Don't do this unless you're sure you know what you're doing. CONTINUE?
de: Datenträger %s ist kleiner als gesamte Datenmenge auf Datenträger %s. Wenn Sie wollen, können Sie so viele Daten wie möglich übertragen. Beginnen Sie den Prozess nicht, wenn Sie nicht wissen was passieren könnte. FORTFAHREN?

source: Down
de: Nach unten

source: EMPTY SPACE INFO:
de: LEERRAUM INFO:

source: Empty space
de: Leer

source: Enter ending cylinder (%u-%u) or size in megabytes with 'm' (1m-%um), or size in cylinders with 'c' (1c-%uc)
de: Geben Sie den Endzylinder von %u bis %u an oder geben Sie die Größe in Megabytes an mit 'm' (1m-%um), oder geben Sie die Größe der Zylinder an mit 'c' (1c-%uc)

source: Enter starting cylinder (%u-%u)
de: Geben Sie Start- und End-Zylinder (%u-%u)

source: Enter starting cylinder: (%u-%u)
de: Startzylinder eingeben: (%u-%u)

source: Erase
de: Löschen

source: Erase complete
de: Löschvorgang abgeschlossen

source: Erase complete
de: Löschvorgang abgeschlossen

source: Erase disk
de: Datenträger löschen

source: Erase partition %s
de: Partition löschen %s

source: Erase partition or disk?
de: Partition oder Datenträger löschen?

source: Erase security level
de: Sicherheits-Level

source: Erase the partition or the whole disk?:
de: Partition oder gesamten Inhalt des Datenträgers entfernen?:

source: Erase this empty space
de: Diesen Leerraum entfernen

source: Erase whole disk %s
de: Gesamten Datenträger löschen %s

source: Erasing clears the data securely by overwriting successive passes of random data. More passes is more secure but takes longer. Choose the security level:
de: Löschvorgang entfernt die Daten sicher, indem Daten mehrmals mit zufälligen Daten überschrieben werden. Mehrere Überschreibungen sind sicherer nehmen aber auch mehr Zeit in Anspruch. Wählen Sie das Sicherheits-Level:

source: Erasing data...
de: Entfernt Daten...

source: Error
de: Fehler

source: Error %d erasing %s
de: Fehler %d beim Löschen von %s

source: Error %d reading %u sectors at %u from disk %s
de: Fehler %d beim Lesen %u der Sektoren %u auf Datenträger %s

source: Error %d reading partition table, data may be incorrect. Proceed with caution.
de: Fehler %d beim Lesen der Partitions-Tabelle, Daten können fehlerhaft sein. Fahren Sie mit Bedacht fort.

source: Error %d running bootmenu command
de: Fehler %d beim Ausführen des Bootmenü-Befehls

source: Error %d writing %u sectors at %u to disk %s
de: Fehler %d beim Schreiben %u der Sektoren %u auf Datenträger %s

source: Error during defragmentation
de: Fehler bei der Defragmentierung

source: Error during filesystem resize
de: Fehler bei Skalierung des Dateisystems

source: Error during format
de: Fehler bei der Formatierung

source: Error getting memory
de: Kann keinen Speicherplatz ermitteln

source: Error opening backup partition table file
de: Fehler beim Öffnen der Backupdatei für die Partitions-Tabelle

source: Error reading backup partition table file
de: Fehler beim Lesen der Backupdatei für die Partitions-Tabelle

source: Error reading filesystem information. However, it is possible to resize the partition anyway and discard all of the data it contains. Continue?
de: Fehler beim Lesen der Dateisystem-Informationen. Sie können die Partition trotzdem skalieren und alle enthaltenen Daten verwerfen. Fortfahren?

source: Error writing backup partition table file
de: Fehler beim Schreiben einer Backupdatei für die Partitions-Tabelle

source: FAT Type
de: FAT-Art

source: File
de: Datei

source: Filesystem
de: Dateisystem

source: Filesystem and partition (recommended)
de: Dateisystem und Partition (empfohlen)

source: Filesystem resize cancelled
de: Skalierung des Dateisystems abgebrochen

source: Filesystem resize complete
de: Skalierung des Dateisystems abgeschlossen

source: Format
de: Formatierung

source: Format Partition %s
de: Dateisystem %s

source: Format complete
de: Formatierung abgeschlossen

source: Format partition %s as %s? (This change cannot be undone)
de: Partition %s als %s formatieren? Änderung kann nicht rückgängig gemacht werden

source: GPT entries checksum mismatch (%x != %x)
de: GPT Eintrags Prüfsumme unstimmig (%x != %x)

source: GPT header checksum mismatch (%x != %x)
de: GPT Header Prüfsumme unstimmig (%x != %x)

source: Hide/Unhide
de: Verstecken/Wiederherstellen

source: Hide/unhide
de: Verstecken/Wiederherstellen

source: Ignore
de: Ignorieren

source: Ignore
de: Ignorieren

source: Info
de: Information

source: Invalid ending cylinder number
de: Ungültiger Endzylinder

source: Invalid starting cylinder number
de: Ungültiger Startzylinder

source: List types
de: Unterstützte Systeme

source: Logical
de: Logisch

source: Logical partition cannot start on a cylinder boundary
de: Logische Partition kann nicht auf Zylindergrenze beginnen

source: MBR boot menu
de: MBR Bootmenü

source: Move
de: Verschieben

source: Moving
de: Verschieben

source: Moving %llu MB
de: Verschiebe %llu MB

source: Moving partition from cylinder %u to cylinder %u. Continue?
de: Verschiebe Partition von Zylinder %u zu Zylinder %u. Fortfahren?

source: Must be more than one primary partition to reorder!
de: Für die Umordnung muss mehr als eine primäre Partition vorhanden sein!

source: New Feature
de: Neue Funktionen

source: No
de: Nein

source: No disk selected. Quitting.
de: Kein Datenträger ausgewählt. Abbrechen.

source: No empty space on either side!
de: Leerraum an den Seiten unzulässig!

source: No fixed disks to manage. Quitting.
de: Keine Festplatten können verwaltet werden. Abbruch.

source: No hard disks registered
de: Keine Festplatten registriert

source: No other disks to copy to
de: Keine anderen Datenträger verfügbar

source: No partition copied to the clipboard
de: Es befinden sich keine Partitionen auf dem Datenträger

source: No partitions on the disk. Do you want to copy the whole disk anyway?
de: Keine Partitionen auf dem Datenträger. Wollen Sie dennoch den gesamten Datenträger übertragen?

source: None
de: Keine

source: Not much point in copying a disk to itself!
de: Es macht keinen Sinn den Inhalt des Datenträgers auf sich selbst zu kopieren!

source: PARTITION %s INFO: Active : %s
de: PARTITION %s INFO: Aktiv : %s

source: Partition %s ending CHS sector is %u, should be %u
de: Partition %s mit CHS Sektor %u am Ende, sollte angegeben werden als %u

source: Partition %s ending cylinder is %u, should be %u
de: Partition %s mit End-Zylinder %u, sollte angegeben werden als %u

source: Partition %s ending head is %u, should be %u
de: Partition %s mit Header %u am Ende, sollte angegeben werden als %u

source: Partition %s is too big (%llu sectors) to fit in the selected empty space (%llu sectors)
de: Partition %s ist zu groß (%llu Sektoren) um in den gewählten Leerraum übertragen zu werden (%llu Sektoren)

source: Partition %s starting CHS sector is %u, should be %u
de: Partition %s mit CHS Sektor %u am Anfang, sollte angegeben werden als %u

source: Partition %s starting cylinder is %u, should be %u
de: Partition %s mit Start-Zylinder %u, sollte angegeben werden als %u

source: Partition %s starting head is %u, should be %u
de: Partition %s mit Header %u am Anfang, sollte angegeben werden als %u

source: Partition Is Mounted
de: Partition ist verbunden

source: Partition Order
de: Partitionsordnung

source: Partition only
de: Nur Partition

source: Partition order
de: Partitionsordnung

source: Partition table consistency check failed. Continue anyway?
de: Überprüfung der Widerspruchsfreiheit der Partitions-Tabelle fehlgeschlagen. Trotzdem fortfahren?

source: Partition table consistency check failed. Write anyway?
de: Überprüfung der Widerspruchsfreiheit der Partitions-Tabelle fehlgeschlagen. Trotzdem schreiben?

source: Paste
de: Einfügen

source: Paste partition %s to selected empty space on disk %s?
de: Partition %s auf gewählten Leerraum auf Datenträger %s übertragen?

source: Please choose the disk on which to operate:
de: Bitte wählen Sie den Datenträger auf dem die Anwendung ausgeführt werden soll:

source: Please choose the disk to copy to:
de: Wählen Sie den Datenträger für den Kopiervorgang:

source: Please select the type of resize operation:
de: Bitte wählen Sie die Art der Skalierung:

source: Please use this feature with caution; it is not well tested. Continue?
de: Benutzen Sie diese Funktion mit großer Vorsicht; sie ist nicht genügend erprobt. Fortfahren?

source: Primary
de: Primär

source: Problem getting hard disk info
de: Kann keine Festplatteninformationen abfragen

source: Quit
de: Abbrechen

source: Quit without writing changes?
de: Abbrechen ohne Änderungen zu übernehmen?

source: Read error %d reading sectors %u-%u from disk %s
de: Lesefehler %d in den Abschnitten %u-%u des Datenträgers %s

source: Resize
de: Skalieren

source: Resize Partition
de: Partition skalieren

source: Resize Type
de: Skalierungsart

source: Resizing
de: Skalierung

source: Resizing Filesystem...
de: Dateisystem wird skaliert...

source: Resizing partition from %llu to %u sectors. Please use this feature with caution, and only after making a backup of all important data. Continue?
de: Skaliere Partition von %llu zu %u Sektoren. Verwenden Sie diese Option mit Vorsicht und nur nachdem Sie ein Backup der wichtigsten Daten erstellt haben. Fortfahren?

source: Resizing the filesystem on this partition is not supported. However, it is possible to resize the partition anyway and discard all of the data it contains. Continue?
de: Sie können das Dateisystem auf dieser Partition nicht skalieren. Sie können das Dateisystem dennoch skalieren und alle enthaltenen Daten verwerfen. Fortfahren?

source: Restore backup
de: Backup wiederherstellen

source: Restore old partition table from backup?
de: Alte Partitions-Tabelle aus Backup wiederherstellen?

source: Select
de: Wählen

source: Set active
de: Aktivieren

source: Set type
de: Art wählen

source: Size(MB)
de: Größe(MB)

source: Starting Cyl/Hd/Sect: %u/%u/%u Ending Cyl/Hd/Sect : %u/%u/%u Logical start sector: %llu Logical size: %llu
de: Startzyl/Hd/Sekt: %u/%u/%u Endzyl/Hd/Sekt : %u/%u/%u Logischer Startsektor: %llu Logische Größe: %llu

source: Starting Cylinder
de: Startzylinder

source: Starting cylinder is not valid
de: Startzylinder ist ungültig

source: Success
de: Erfolgreich

source: Supported Partition Types
de: Unterstützte Systeme

source: Table at %u has no signature
de: Tabelle auf %u hat keine Signatur

source: Terminating processes...
de: Prozesse beenden...

source: The partition is mounted as %s. It is STRONGLY recommended that you unmount before continuing
de: Partition ist mit %s verbunden. Es wird DRINGEND empfohlen dass Sie alles trennen bevor Sie fortfahren

source: The partition table is full of primary partitions. Use more logical partitions in order to create more.
de: Die Partitions-Tabelle ist gefüllt mit primären Partitionen. Verwenden Sie mehr logische Partitionen, um mehr von ihnen zu erstellen.

source: This operation cannot be undone, and it is required that you write your other changes to disk before continuing.
de: Dieser Vorgang kann nicht rückgängig gemacht werden und Sie müssen alle Änderungen auf einem Datenträger speichern bevor Sie fortfahren.

source: Time remaining:
de: Restdauer:

source: Time remaining: ?? hours ?? minutes
de: Restdauer: ?? Stunden ?? Minuten

source: Type GUID :
de: Art GUID :

source: Type ID : %02x
de: Art ID : %02x

source: Unable to allocate memory
de: Kann Speicher nicht zuordnen

source: Unable to allocate memory buffer!
de: Kann Zwischenspeicher nicht zuordnen!

source: Unable to unmount %s
de: Kann nicht getrennt werden %s

source: Unable to write the partition table of %s.
de: Kann Partitions-Tabelle von %s nicht schreiben.

source: Undo
de: Rückgängig

source: Unformat partition %s? (This change cannot be undone)
de: Format von Partition löschen %s? (Änderung kann nicht rückgängig gemacht werden)

source: Unknown disk label. Writing changes will create an MS-DOS label.
de: Unbekannte Datenträger-Bezeichnung. Bearbeitung erstellt eine MS-DOS Bezeichnung.

source: Unmount
de: Trennen

source: Unmount
de: Trennen

source: Unsupported partition type %x
de: Partitionsart wird nicht unterstützt %x

source: Up
de: Nach oben

source: Warning
de: Warnung

source: Write
de: Übernehmen

source: Write basic MBR
de: In MBR schreiben

source: Write changes
de: Änderungen übernehmen

source: Write error %d writing sectors %u-%u to disk %s
de: Schreibfehler %d in den Abschnitten %u-%u auf Datenträger %s

source: Yes
de: Ja

source: You have at least one disk running in unsupported native-SATA mode. You may be able to temporarily enable ATA or 'legacy' IDE mode in your BIOS setup.
de: Mindestens eine Disk läuft im nativen SATA-Modus, der nicht unterstützt wird. Sie sollten vielleicht zeitweise den ATA- oder IDE-Modus (Legacy-Modus) in Ihren BIOS-Einstellungen aktivieren.

source: You must be a privileged user to use this command. (Try logging in as user "admin")
de: Um diesen Befehl auszuführen müssen Sie spezielle Rechte besitzen. (Versuchen Sie die Anmeldung als "admin")

source: [A] Set active
de: [A] Aktivieren

source: [B] Partition order
de: [B] Partitionsordnung

source: [C] Copy disk
de: [C] Datenträger kopieren

source: [D] Delete
de: [D] Entfernen

source: [E] Copy partition
de: [E] Partition kopieren

source: [G] Defragment
de: [G] Defragmentieren

source: [H] Hide/Unhide
de: [H] Verstecken/Wiederherstellen

source: [L] List types
de: [L] Unterstützte Systeme

source: [M] Move
de: [M] Verschieben

source: [N] Create new
de: [N] Neu

source: [O] Delete all
de: [O] Alle entfernen

source: [P] Paste partition
de: [P] Partition einfügen

source: [Q] Quit
de: [Q] Abbrechen

source: [R] Restore backup
de: [R] Backup wiederherstellen

source: [S] Select disk
de: [S] Datenträger auswählen

source: [T] Set type
de: [T] Dateisystem wählen

source: [U] Undo
de: [U] Rückgängig

source: [V] Erase
de: [V] Löschen

source: [W] Write changes
de: [W] Änderungen übernehmen

source: [X] Write basic MBR
de: [X] In MBR schreiben

source: [Y] MBR boot menu
de: [Y] MBR Bootmenü

source: [Z] Resize
de: [Z] Skalieren

source: basic (clear only)
de: einfach (nur entfernen)

source: default
de: standard

source: disk
de: Datenträger

source: less than 1 minute
de: weniger als 1 Minute

source: logical
de: logisch

source: more secure
de: sicherer

source: most secure
de: am sichersten

source: no
de: nein

source: none
de: keine

source: primary
de: primär

source: secure
de: sicher

source: unknown
de: unbekannt

source: whole disk
de: gesamten Datenträger

source: yes
de: Ja
