Repository: bbarker/Visopsys
Catalog: contrib/jens-*/src/programs/*/copy-boot.po
Languages: de

source: %s is not a valid boot sector
de: %s ist kein gültiger Bootsektor

source: %u FATs of %u
de: %u FATs von %u

source: %u reserved
de: %u reserviert

source: %u root dir sectors
de: %u Rootverzeichnis-Sektoren

source: Add boot sector signature
de: Bootsektor-Signatur hinzufügen

source: Can't alloc %u bytes to find an unused cluster
de: Kann nicht %u bytes zum Finden eines unbenutzten Clusters zuteilen

source: Can't open device %s
de: Das Gerät %s kann nicht geöffnet werden

source: Can't read FAT sector
de: FAT-sektor kann nicht gelesen werden

source: Can't read sector
de: Sektor kann nicht gelesen werden

source: Can't write sector
de: Sektor kann nicht geschrieben werden

source: Couldn't read boot sector from %s
de: Der Bootsektor von %s konnte nicht gelesen werden

source: Couldn't write backup boot sector to %s
de: Der Backup-Bootsektor konnte nicht in %s geschrieben werden

source: Couldn't write boot sector to %s
de: Der Bootsektor konnte nicht in %s geschrieben werden

source: Error reading disk %s
de: Lesefehler in Disk %s

source: Error writing disk %s
de: Schreibfehler in Disk %s

source: File system type is not supported
de: Dateisystem-type nicht unterstützt

source: Find first unused cluster
de: Suche den ersten unbenutzten Cluster

source: First unused cluster %u
de: Erster unbenutzter Cluster %u

source: First user sector for OS loader is %u
de: Erster Benutzersektor für OS Loader ist %u

source: Merge boot sectors
de: Boot sektoren vereinen

source: OS loader sectors are %u
de: OS Ladesektoren sind %u

source: Read boot sector from %s
de: Lese Bootsektor von %s

source: Root dir cluster %u
de: Root Verzeichniscluster %u

source: Sectors per cluster %u
de: Sektoren pro Cluster %u

source: Set OS loader parameters
de: OS Ladeparameter einstellen

source: Target filesystem is FAT12
de: Zieldateisystem ist FAT12

source: Target filesystem is FAT16
de: Zieldateisystem ist FAT16

source: Target filesystem is FAT32
de: Zieldateisystem ist FAT32

source: Unknown FAT type %s
de: Unbekannter FAT Typ %s

source: Write boot sector to %s
de: Schreibe Bootsektor nach %s

source: fat32BSHeader size is 0x%02x instead of 0x5A
de: fat32BSHeader Grösse ist 0x%02x statt 0x5A

source: fat32FsInfo size is %d instead of 512
de: fat32FsInfo Grösse ist %d statt of 512

source: fatBSHeader size is 0x%02x instead of 0x3E
de: fatBSHeader Grösse ist 0x%02x statt 0x3E

source: usage: %s <boot image> <output file|device>
de: Benutzung: %s <boot-image> <outputdatei|gerät>
