Repository: bbarker/Visopsys
Catalog: contrib/jens-*/src/programs/*/sysdiag.po
Languages: de

source: Press any key to continue%s
de: Weiter mit beliebiger Taste%s

source: [ Press 'Q' to cancel ]
de: [ Drücken Sie 'Q' zum abbrechen ]

source: %d errors
de: %d Fehler

source: , or 'q' to quit
de: , oder 'q' zum abbrechen

source: Disk read error at sector %llu
de: Lesefehler bei Sektor %llu

source: Disk write error at sector %llu
de: Schreibfehler bei Sektor %llu

source: Do you want to do a disk test, or a memory test?
de: Wollen Sie einen Disk- oder Speichertest machen?

source: Do you want to do a read-only test, or a read-write test? A read-only test is faster and guaranteed to be data-safe, however it is less thorough. A read-write test takes longer and is more thorough, but can potentially cause some data loss if your disk is failing.
de: Wollen Sie einen Nur-Lesen- oder einen Lesen-Schreiben-Test durchführen? Ein Nur-Lesen-Test ist schneller und garantiert datensicher, ist jedoch weniger gründlich. Ein Lesen-Schreiben-Test braucht länger und ist gründlicher, kann aber potentiell Datenverlust verursachen, wenn Ihre Disk versagt.

source: Do you want to view the results?
de: Wollen Sie sich die Ergebnisse ansehen?

source: Error
de: Fehler

source: Error performing test
de: Fehler beim durchführen des Tests

source: Memory error at %llu
de: Speicherfehler bei %llu

source: Memory test
de: Speichertest

source: Performing %s test on disk %s
de: Test %s auf Disk %s läuft...

source: Performing memory test of %uMB - %uMB in use
de: Speichertest bei %uMB - %uMB (in Benutzung) läuft

source: Please choose the disk to test:
de: Bitte wählen Sie die Disk die getestet werden soll:

source: Quit
de: Beenden

source: Read-only
de: Nur-Lesen

source: Read-write
de: Lesen-Schreiben

source: System Diagnostics
de: Systemdiagnose

source: Test cancelled
de: Test wurde abgebrochen

source: Test completed
de: Test wurde beendet

source: Test results
de: Testergebnisse

source: Testing disk sectors %llu/%llu
de: Sektorentest %llu/%llu

source: Testing memory MB %llu/%llu
de: Speichertest (in MB) %llu/%llu

source: View results
de: Ergebnisse ansehen

source: You must be a privileged user to use this command. (Try logging in as user "admin")
de: Um diesen Befehl auszuführen müssen Sie spezielle Rechte besitzen. (Versuchen Sie sich als "admin" anzumelden)

source: read-only
de: Nur-Lesen

source: read-write
de: Lesen-Schreiben
