Repository: bbarker/Visopsys
Catalog: src/lib/libwindow/*/libwindow.po
Languages: tr

source: Error
tr: Hata

source: Memory allocation error creating icon parameters
tr: Ikon parametreleri olusturulurken bellek ayirma hatasi

source: Color Chooser
tr: Renk Seçici

source: Red
tr: Kirmizi

source: Green
tr: Yesil

source: Blue
tr: Mavi

source: OK
tr: Tamam

source: Cancel
tr: Iptal

source: (up)
tr: (yukari)

source: Can't get directory "%s" file count
tr: Klasörün "%s" dosya sayisi alinamiyor

source: Memory allocation error
tr: Bellek ayirma hatasi

source: Error reading files in "%s"
tr: "%s" içindeki dosyalar okunurken hata olustu

source: Can't change to directory %s
tr: %s klasörü açilamiyor

source: Error deleting file %s
tr: %s dosyasi silinirken hata olustu

source: Can't locate configuration file %s
tr: %s konfigurasyon dosyasi bulunamadi

source: Confirmation
tr: Dogrulama
