Repository: bbarker/Visopsys
Catalog: src/programs/*/bootmenu.po
Languages: de

source: Boot Menu Installer
de: Installationsprogramm im Boot-Menü

source: Visopsys Boot Menu Installer Copyright (C) 1998-2016 J. Andrew McLaughlin
de: Visopsys Installationsprogramm für das Boot-Menü Copyright (C) 1998-2016 J. Andrew McLaughlin

source: You must be a privileged user to use this command. (Try logging in as user "admin")
de: Um diesen Befehl auszuführen müssen Sie spezielle Rechte besitzen. (Versuchen Sie sich als "admin" anzumelden)

source: Partitions on the disk:
de: Partitionen auf der Disk:

source: Chain-loadable entries for the boot menu:
de: Nacheinander ladefähige Einträge für das Boot-Menü:

source: Edit
de: Bearbeiten

source: Default
de: Standard

source: Delete
de: Löschen

source: Automatically boot default selection after (seconds)
de: Die Standardauswahl automatisch starten nach (Sekunden)

source: Cancel
de: Abbrechen

source: Boot menu written.
de: Boot-Menü wurde geschrieben.

source: usage: %s <disk name>
de: Benutzung: %s <Name der Disk>

source: Error
de: Fehler

source: Edit entry label
de: Name bearbeiten

source: Enter new label (%d characters max.): [%s] [
de: Neuen Namen vergeben (%d Zeichen max.): [%s] [

source: Can't get memory for the logical disk list
de: Es konnte kein Speicher für die Liste gewiesen werden

source: Can't get the logical disk list
de: Es konnte keine Liste von Disks gefunden werden

source: Can't open %s file
de: Datei %s konnte nicht geöffnet werden

source: Can't get buffer memory
de: Speicherpuffer konnte nicht bezogen werden

source: Can't read %s file
de: Datei %s konnte nicht gelesen werden

source: Disk %s Label: %s Filesystem: %s Chain-loadable: %s
de: Disk %s Name: %s Dateisystem: %s Nacheinander ladefähig: %s

source: yes
de: ja

source: no
de: nein

source: Can't write boot menu
de: Boot-Menü konnte nicht geschrieben werden

source: Can't write MBR %s to %s
de: MBR %s konnte nicht auf %s geschrieben werden

source: Permission Denied
de: Zugriff verweigert

source: Can't get disk %s
de: Disk %s wurde nicht gefunden

source: Disk %s is not a physical hard disk device
de: Disk %s ist keine physikalisch vorhandene Festplatte

source: Can't get the list of logical disks
de: Es konnte keine Liste von Disks gefunden werden

source: "%s" [Filesystem: %s]
de: "%s" [Dateisystem: %s]

source: There are no chain-loadable operating systems on this disk.
de: Auf der Disk existieren keine nacheinander ladefähigen Betriebssysteme.

source: [Cursor up/down to select, 'e' edit, '*' default 'd' delete, Enter to accept, 'Q' to quit]
de: [Bewegen Sie den Cursor nach oben/unten für die Auswahl, "e" zum bearbeiten, "*" für den Standard "d" zum löschen, "Enter" zum annehmen, "q" zum abbrechen]

source: Can't write boot menu or MBR
de: Boot-Menü oder MBR konnte nicht geschrieben werden

source: Done
de: Fertig
