Repository: bbarker/Visopsys
Catalog: src/programs/*/computer.po
Languages: ru

source: Computer
ru: Компьютер

source: Browse
ru: Обзор

source: Mount as...
ru: Подключить как...

source: Unmount
ru: Отключить

source: Properties
ru: Свойства

source: Error
ru: Ошибка

source: Filesystem on %s is not supported for browsing
ru: Файловая система на %s не поддерживается для обзора

source: Can't mount %s on %s
ru: Не могу подключить %s на %s

source: No media in disk %s
ru: Нет носителя в %s

source: Error launching file browser
ru: Ошибка запуска файлового менеджера

source: Disk is already mounted as %s
ru: Диск уже подключен как %s

source: Mount point
ru: Точка подключения

source: Please enter the mount point
ru: Введите точку подключения

source: Disk %s is not mounted
ru: Диск %s не подключен

source: Error unmounting %s
ru: Ошибка отключения %s

source: Fixed
ru: Исправлено

source: Removable
ru: Съемный

source: floppy
ru: НГМД

source: hard disk
ru: жесткий диск

source: Size: %llu MB
ru: Размер: %llu MB

source: Partition type: %s
ru: Тип раздела: %s

source: Filesystem type: %s
ru: Тип ФС: %s

source: Mounted as %s%s
ru: Подключено как %s%s

source: (read only)
ru: (только чтение)

source: Memory allocation error
ru: Ошибка распределения памяти.

source: Disk
ru: Диск

source: The "%s" command only works in graphics mode
ru: Команда "%s" работает только в графическом режиме

source: Can't load icon image %s
ru: Не могу загрузить значок%s
