Repository: bbarker/Visopsys
Catalog: src/programs/*/copy-mbr.po
Languages: es

source: usage: %s <MBR image> <output device>
es: Uso: %s <imágen_MBR> <dispositivo_de_salida>

source: Read MBR sector from %s
es: Leer sector MBR de %s

source: Error reading disk %s
es: Error al leer el disco %s

source: Error opening file %s
es: Error al abrir el archivo %s

source: Error reading file %s
es: Error al leer el archivo %s

source: Could only read %d bytes from %s
es: Sólo se pueden leer %d Bytes de %s

source: Add disk signature to new MBR
es: Agregar signatura de disco al nuevo MBR

source: Copy partition table to new MBR
es: Copiar tabla de particiones al MBR nuevo

source: Write MBR sector to %s
es: Escribir sector MBR a %s

source: Error writing disk %s
es: Error al escribir el disco %s
