Repository: bbarker/Visopsys
Catalog: src/programs/*/defrag.po
Languages: de

source: Confirmation
de: Bestätigung

source: Press any key to continue.
de: Drücke eine Taste zum Fortfahren.

source: Error
de: Fehler

source: Choose Disk
de: Wähle eine Disk

source: Cancel
de: Abbrechen

source: The disk is mounted as %s. It is STRONGLY recommended that you unmount before continuing
de: Die Disk wurde als %s verbunden. Es wird SEHR empfohlen diese erst zu trennen

source: Disk is mounted
de: Disk verbunden

source: Ignore
de: Ignorieren

source: Unmount
de: Trennen

source: %s (I)gnore/(U)nmount/(C)ancel?:
de: %s (I) Ignorieren/(U) Trennen/(C) Abbrechen?:

source: Ignore
de: Ignorieren

source: Unmount
de: Trennen

source: Cancel
de: Abbrechen

source: Unable to unmount %s
de: %s kann nicht getrennt werden

source: Error getting disks info
de: Fehler beim Aufrufen der Disk Info

source: Visopsys DEFRAG Utility Copyright (C) 1998-2016 J. Andrew McLaughlin
de: Visopsys DEFRAG Werkzeug Copyright (C) 1998-2016 J. Andrew McLaughlin

source: You must be a privileged user to use this command. (Try logging in as user "admin")
de: Sie müssen ein Benutzer mit bestimmten Rechten sein. (Versuchen Sie, sich als "admin" anzumelden)

source: Unknown filesystem type on disk "%s"
de: Unbekannter Dateisystem-typ auf der Disk "%s"

source: Error getting info for disk "%s"
de: Fehler beim Aufrufen der Info für die Disk "%s"

source: Defragmenting the filesystem type "%s" is not supported
de: Defragmentierung des Dateisystem-typs "%s" ist nicht unterstützt

source: Defragmenting disk %s. Are you sure?
de: Defragmentire Disk %s. Sind Sie sicher?

source: Quitting.
de: Abbrechen...

source: Defragmenting...
de: Defragmentiere...

source: Defragmentation complete
de: Defragmentation abgeschlossen

source: Success
de: Fertig
