Repository: bbarker/Visopsys
Catalog: src/programs/*/disprops.po
Languages: tr

source: Display Settings
tr: Ekran Ayarlari

source: Screen resolution:
tr: Ekran çözünürlügü:

source: Colors:
tr: Renkler:

source: Foreground
tr: Önplan

source: Background
tr: Arkaplan

source: Desktop
tr: Masaüstü

source: Change
tr: Degistir

source: Background wallpaper:
tr: Arkaplan duvar kagidi:

source: Choose
tr: Seç

source: Use background wallpaper
tr: Arkaplan duvar kagidini kullan

source: Miscellaneous:
tr: Çesitli:

source: Boot in graphics mode
tr: Grafik modda boot et

source: Show a clock on the desktop
tr: Masaüstünde saati göster

source: OK
tr: Tamam

source: Cancel
tr: Iptal

source: The resolution has been changed to %dx%d, %dbpp This will take effect after you reboot.
tr: Ekran çözünürlügü %dx%d 'e degistirildi, %dbpp Bir sonraki yeniden baslatmada uygulanacak.

source: Changed
tr: Degistirildi

source: Error %d setting mode
tr: %d modu ayarlanirken hata olustu

source: Error
tr: Hata

source: The "%s" command only works in graphics mode
tr: "%s" komutu sadece grafik modda çalisabilir
