Repository: bbarker/Visopsys
Catalog: src/programs/*/filesys.po
Languages: de

source: File systems
de: Dateisysteme

source: Mount point:
de: Verbindungspunkt:

source: Mount automatically at boot
de: Beim Start automatisch verbinden

source: Unsaved changes
de: Ungespeicherte Änderungen

source: Quit without writing changes?
de: Beenden ohne Übernahme der Änderungen?

source: Quit
de: Beenden

source: Cancel
de: Abbrechen

source: Save
de: Speichern

source: Error
de: Fehler

source: Quitting.
de: Wird beendet.

source: No disks to work with.
de: Keine Disks mit der gearbeitet werden kann.

source: Memory allocation error.
de: Fehler bei der Speicheraufteilung.

source: Unable to get disk information.
de: Informationen zu der Disk nicht verfügbar.

source: Can't read/create the mount configuration
de: Die Konfiguration der Verbindung kann nicht gelesen/erstellt werden

source: Can't write the mount configuration
de: Die Konfiguration der Verbindung kann nicht geschrieben werden

source: The "%s" command only works in graphics mode
de: Der Befehl "%s" funktioniert nur im Grafik-Modus
