Repository: bbarker/Visopsys
Catalog: src/programs/*/sysdiag.po
Languages: ru

source: System Diagnostics
ru: Диагностика системы

source: Disk test
ru: Тест диска

source: Memory test
ru: Тест памяти

source: Read-only
ru: Только чтение

source: Read-write
ru: Чтение-запись

source: Test
ru: Тест

source: Quit
ru: Выход

source: You must be a privileged user to use this command. (Try logging in as user "admin")
ru: Вы должны быть более привелегированным пользователем. (Попробуйте войти как "admin")

source: Do you want to do a read-only test, or a read-write test? A read-only test is faster and guaranteed to be data-safe, however it is less thorough. A read-write test takes longer and is more thorough, but can potentially cause some data loss if your disk is failing.
ru: Хотите провести тест с параметром только-чтение, или же с параметром чтение-запись? Тест только чтением гарантирует сохранность данных, но он менее тщательный. Тест с чтениме-записью более тщательный и требует больше времени, но так же может привести к потере данных.

source: Performing %s test on disk %s
ru: Выполняется тест %s диска %s

source: Performing memory test of %uMB - %uMB in use
ru: Выполняется тестирование памяти в %uMB - %uMB занято

source: Test cancelled
ru: Тест отменен

source: Test completed
ru: Тест выполнен

source: Error performing test
ru: Ошибка выполнения теста

source: %d errors
ru: %d ошибок

source: Press any key to continue%s
ru: Нажмите любую клавишу чтобы продолжить%s

source: , or 'q' to quit
ru: , или 'q' чтобы выйти

source: Error
ru: Ошибка

source: Please choose the disk to test:
ru: Выберите диск для теста:

source: View results
ru: Просмотреть результаты

source: Do you want to view the results?
ru: Вы хотите просмотреть результаты?

source: Test results
ru: Результаты теста

source: Disk read error at sector %llu
ru: Ошибка чтения диска в секторе %llu

source: Disk write error at sector %llu
ru: Ошибка записи на диск в сеткоре %llu

source: Memory error at %llu
ru: Ошибка памяти в %llu

source: read-only
ru: только чтение

source: [ Press 'Q' to cancel ]
ru: [ Нажмите 'Q' для отмены ]

source: Testing disk sectors %llu/%llu
ru: Тест секторов диска %llu/%llu

source: Testing memory MB %llu/%llu
ru: Тест памяти MB %llu/%llu

source: Do you want to do a disk test, or a memory test?
ru: Хотите провести тести диска или тест памяти?
