Repository: bbarker/Visopsys
Catalog: src/programs/*/view.po
Languages: de, es

source: Actual size
de: Aktuelle Grösse
es: Tamaño actual

source: Error
de: Fehler

source: ERROR: %s
de: FEHLER: %s

source: Loading
de: Lade
es: Cargando

source: Loading image...
de: Lade Bild...
es: Cargando imágen...

source: Error loading the image "%s"
de: Fehler beim Laden des Bildes "%s"
es: Error al cargar la imágen "%s"

source: Unable to load the image "%s"
de: Das Bild "%s" kann nicht geladen werden
es: No se puede cargar la imágen "%s"

source: Image
de: Bild
es: Imágen

source: Unable to load the file "%s"
de: Die Datei "%s" kann nicht geladen werden
es: No se puede cargar el archivo "%s"

source: The "%s" command only works in graphics mode
de: Das Kommando "%s" funktioniert nur im Grafikmodus
es: El comando "%s" funciona solamente en modo gráfico

source: Enter filename
de: Gebe einen Dateinamen ein
es: Ingrese un nombre de archivo

source: Please choose the file to view:
de: Bitte wähle eine Datei zum Anschauen:
es: Selecciona un archivo para mostrar:

source: The file "%s" was not found
de: Datei "%s" nicht gefunden
es: Archivo "%s" no encontrado

source: Unable to classify the file "%s"
de: Die Datei "%s" kann nicht unterschieden werden
es: No se puede clasificar el archivo "%s"

source: Can't display the file type of "%s" (%s)
de: Dateityp von "%s" kann nicht angezeigt werden (%s)
es: El tipo de archivo "%s" no se puede mostrar (%s)
