Repository: bbarker/Visopsys
Catalog: src/programs/*/vsh.po
Languages: ru

source: Usage: %s <file1> [file2] [...]
ru: Использование: %s <файл1> [файл2] [...]

source: Usage: %s <source file> <destination file>
ru: Использование: %s <исходный файл> <конечный файл>

source: Usage: %s <variable_name>
ru: Использование: %s <имя_переменной>

source: Shouldn't set an env variable that long
ru: Не стоит назначать переменную jокружения являющуюся long

source: Usage: %s <variable_name> <variable_value>
ru: Использование: %s <имя_переменной> <значение_переменной>

source: Unknown command "%s".
ru: Неизвестная команда "%s".

source: logout
ru: выход

source: Type "help" for commands.
ru: Наберите "help" для списка команд.

source: Can't determine current directory
ru: Невозможно определить текущий каталог

source: exiting.
ru: выход.
