Repository: bbarker/Visopsys
Catalog: ports/ntfsprogs/*/libntfs.po
Languages: de, es, ru, tr

source: Relocation needed for inode %8lld
de: Es wird eine Neuplatzierung benötigt für inode %8lld
es: Se necesita reubicar el inode %8lld
ru: Перемещение необходимое для inode %8lld
tr: %8lld dügümü için yeniden yerlestirme gerekiyor

source: Accounting clusters
de: Die Cluster werden berechnet
es: Contabilizando Clústeres
ru: Подсчет кластеров
tr: Kümeler sayiliyor

source: Checking filesystem consistency
de: Die Konsistenz des Dateisystems wird überprüft
es: Chequeando consistencia del sistema de archivos
ru: Проверка целостности файловой системы
tr: Dosya sistemi tutarliligi kontrol ediliyor

source: Collecting resizing constraints
de: Die Bedingungen für die Größenanpassung werden zusammengestellt
es: Encontrando límites de cambio de tamaño
ru: Сбор изменений размера
tr: Boyutlanan kisitlamalar toparlaniyor

source: Enlarging attribute header ...
de: Die Attribut-Kopfzeile wird vergrößert...
es: Agrandando encabezador de atributos...
ru: Увеличение заголовка атрибута ...
tr: Bastaki boyut niteligi genisletiliyor...

source: Relocate record %llu 0x%llx->0x%llx
de: Eintrag %llu 0x%llx->0x%llx wird neu platziert
es: Reubicando registro %llu 0x%llx->0x%llx
ru: Перемещение записи %llu 0x%llx->0x%llx
tr: %llu 0x%llx->0x%llx kaydini yeniden yerlestir

source: Relocating needed data
de: Die benötigten Daten werden neu platziert
es: Reubicando datos.
ru: Перемещение необходимых данных
tr: Gerekli veri yeniden yerlestiriliyor

source: Checking for bad sectors
de: Überprüfung auf falsche Sektoren
es: Buscando sectores corruptos
ru: Проверка на сбойные секторы
tr: Bozuk sektörler için kontrol ediliyor

source: Updating $BadClust file
de: Aktualisierung der Datei $BadClust
es: Actualizando el archivo en el clúster $BadClust
ru: Обновление файла $BadClust
tr: $BadClust dosyasi güncelleniyor

source: Updating $Bitmap file
de: Aktualisierung der Datei $Bitmap
es: Actualizando el archivo $Bitmap
ru: Обновление файла $Bitmap
tr: $Bitmap dosyasi güncelleniyor

source: Set up LCN bitmap
de: LCN-Bitmap wird vorbereitet
es: Preparando el mapa de bits LCN
ru: Настройка LCN bitmap
tr: LCN-Bitmap kur

source: Updating Boot record
de: Boot-Eintrag wird aktualisiert
es: Actualizando registro de arranque
ru: Обновление загрузочной записи
tr: Boot kaydi güncelleniyor

source: Mounting volume
de: Laufwerk wird verbunden
es: Montando el volumen
ru: Монтировать том
tr: Disk baglaniyor

source: Schedule chkdsk for NTFS consistency check at Windows boot time
de: Zeitliche Durchführung von chkdsk für die Überprüfung der NTFS-Konsistenz beim Start von Windows festlegen
es: Programe un CHKDSK para consistencia NTFS en el siguiente arranque de Windows
ru: Планируем запуск chkdsk для проверки целостности NTFS во время следующей загрузки Windows
tr: Windows açilisi sirasinda NTFS tutarlilik kontrolü için chkdsk'yi zamanla

source: Resetting $LogFile (this might take a while)
de: Zurücksetzen von $LogFile (das könnte einen Moment dauern)
es: Borrando $LogFile (Esto puede tardar)
ru: Сброс $LogFile (это может занять некоторое время)
tr: $LogFile resetleniyor (bu biraz zaman alabilir)

source: Syncing device
de: Gerät wird synchronisiert
es: Syncronizando dispositivo
ru: Синхронизация устройства
tr: Aygit senkronize ediliyor

source: Successfully resized NTFS on device '%s'.
de: NTFS wurde erfolgreich auf dem Gerät '%s' in der Größe angepasst
es: Éxito al cambiar el tamaño NTFS del dispositivo '%s'.
ru: Размер NTFS успешно изменен на устройстве '%s'.
tr: '%s' aygiti üzerindeki NTFS basarili bir sekilde yeniden boyutlandirildi.
